{
  "maintenance_agency_id" : "ECB",
  "cube_id" : "BIRD_CRDT_CRD_DBT_ELDM_1",
  "name" : "Credit card debt",
  "code" : "BIRD_CRDT_CRD_DBT_ELDM",
  "framework_id" : "BIRD",
  "cube_structure_id" : "BIRD_CRDT_CRD_DBT_ELDM_1",
  "cube_type" : "ELDM",
  "is_allowed" : null,
  "valid_from" : "2023-07-01",
  "valid_to" : "9999-12-31",
  "version" : "1",
  "description" : "Credit card debt is a Loan (excluding Reverse repurchase agreement) fulfilling the definition of Regulation (EU)  1071/2013, Annex 2, Part 2 Definitions of instrument categories, Table Intstrument categories, 2. Loans of up to and including one year/over one year and up to and including five years/over five years’ original maturity, (b) credit card debt:\n[...] comprises credit granted to households or non-financial corporations either via delayed debit cards, i.e. cards providing convenience credit as defined below, or via credit cards, i.e. cards providing convenience credit and extended credit. Credit card debt is recorded on dedicated card accounts and therefore not evident on current or overdraft accounts. Convenience credit is defined as the credit granted at an interest rate of 0 % in the period between the payment transactions effectuated with the card during one billing cycle and the date at which the debit balances from this specific billing cycle become due. Extended credit is defined as the credit granted after the due dates of the previous billing cycles have passed, i.e. debit amounts on the card account that have not been settled when this was first possible, for which an interest rate or tiered interest rates usually greater than 0 % are charged. Often minimum instalments per month have to be made, to at least partially repay extended credit. \nThe counterpart to these forms of credit is the entity liable to eventually repay the amounts outstanding in accordance with the contractual agreement, which coincides with the cardholder in the case of privately used cards, but not in the case of company cards;",
  "published" : "true",
  "dataset_url" : null,
  "filters" : null,
  "di_export" : null,
  "cube_to_combination" : [ ],
  "cube_to_table" : [ ]
}