{
  "maintenance_agency_id" : "ECB",
  "member_id" : "ENTTY_RL_TYP_42",
  "code" : "42",
  "name" : "Linked enterprise",
  "domain_id" : "ENTTY_RL_TYP",
  "description" : "A Linked enterprise is a Central bank and private sector company role in the sense of Commission Recommendation 2003/361/EC.\n\nCommission Recommendation 2003/361/EC, Annex, Title I Definition of micro, small and medium-sized enterprises adopted by the commission, Article 3 Types of enterprise taken into consideration in calculating staff numbers and financial amounts:\n...\n3. ‘Linked enterprises’ are enterprises which have any of the following relationships with each other:\n(a) an enterprise has a majority of the shareholders' or members' voting rights in another enterprise;\n(b) an enterprise has the right to appoint or remove a majority of the members of the administrative, management or supervisory body of another enterprise;\n(c) an enterprise has the right to exercise a dominant influence over another enterprise pursuant to a contract entered\ninto with that enterprise or to a provision in its memorandum or articles of association;\n(d) an enterprise, which is a shareholder in or member of another enterprise, controls alone, pursuant to an agreement with other shareholders in or members of that enterprise, a majority of shareholders' or members' voting rights in that enterprise.\nThere is a presumption that no dominant influence exists if the investors listed in the second subparagraph of paragraph 2 are not involving themselves directly or indirectly in the management of the enterprise in question, without prejudice to their rights as stakeholders.\nEnterprises having any of the relationships described in the first subparagraph through one or more other enterprises, or any one of the investors mentioned in paragraph 2, are also considered to be linked.\nEnterprises which have one or other of such relationships through a natural person or group of natural persons acting jointly are also considered linked enterprises if they engage in their activity or in part of their activity in the same relevant market or in adjacent markets.\nAn ‘adjacent market’ is considered to be the market for a product or service situated directly upstream or downstream of the relevant market."
}